artillery/getgemsbyuserid.yaml
config:
  plugins:
    ensure: {}
  environments:
    develop:
      target: "https://wordbox-gateway-9qeed9h4.uc.gateway.dev"
      http:
        timeout: 10
        extendedMetrics: true
      payload:
        path: "userids.csv"
        fields:
          - "userid"
  phases:
    - name: Warm up
      duration: 5
      arrivalRate: 5
    - name: Ramp up load
      duration: 60
      arrivalRate: 5
      rampTo: 10
  ensure:
    thresholds:
      - "http.response_time.p99": 4000
      - "http.response_time.p95": 2000
    conditions:
      - expression: "http.request_rate > 5"
    maxErrorRate: 1

before:
    flow:
      - log: "Get auth token"
      - post:
          url: "https://us-central1-wordboxdev.cloudfunctions.net/createcustomtoken"
          json:
            environment: "DEV"
          capture:
            - json: $.idToken
              as: token
      - log: "token => {{ token }}"

scenarios:
  - name: "Get gems by user id"
    flow:
      - get:
          url: "/apis/v1/gem"
          qs:
            userid: "{{ userid }}"
          headers:
            Accept: "application/json"
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.gems"
            as: "gems"
          strict: false
      - log: "gems => {{ gems }}"